Конфигурация отчетов/Catalogs/АктивныеСеансы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>АктивныеСеансы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сеанс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация отчетов/Catalogs/АктивныеСеансы/Ext/ManagerModule.bsl
Процедура ЗаписатьСеансов(Пользователь) Экспорт
	
	ЗаписьСеанса = Справочники.АктивныеСеансы.СоздатьЭлемент();
	ЗаписьСеанса.Наименование = НомерСоединенияИнформационнойБазы();
	ЗаписьСеанса.Сеанс = НомерСоединенияИнформационнойБазы();

	ЗаписьСеанса.Пользователь = Пользователь;
	ЗаписьСеанса.Записать();
	
КонецПроцедуры
